#!/bin/bash


#***********************************************************************
# function rm-on-exit() -> deleting temporary files on exit
#-----------------------------------------------------------------------
declare -a files_to_be_deleted

function rm-on-exit() {
	[[ $# -gt 0 ]] && files_to_be_deleted+=("$@")
}

function on-exit() {
	for file in "${files_to_be_deleted[@]:-}"; do
		[[ -f "$file" ]] && rm -r "$file"
	done
	files_to_be_deleted=()
}

trap on-exit EXIT INT TERM QUIT ABRT ERR

# cp "$after_rules" "$after_rules_tmp"  # create temp file
# rm-on-exit "$after_rules_tmp"         # delete temp file
#***********************************************************************
#***********************************************************************








#***********************************************************************
# Функция для выполнения команды с выводом результата
#-----------------------------------------------------------------------
execute_command() {
    local command="$1"
    echo "$>  $command"
    eval "$command"
    local exit_code=$?
    if [ $exit_code -eq 0 ]; then
        echo "--------------------------------------------------"
    else
        echo "Command failed with exit code $exit_code"
    fi
    echo
}
#***********************************************************************




#***********************************************************************
# execute_command "LANG=en_EN.utf-8"
#-----------------------------------------------------------------------
function git--lang_en() {
  execute_command "LANG=en_EN.utf-8"
}
#***********************************************************************



#***********************************************************************
# execute_command "git branch -a"
#-----------------------------------------------------------------------
function git--remote() {
  execute_command "git remote -v"
}
#***********************************************************************


#***********************************************************************
# execute_command "git branch -a"
#-----------------------------------------------------------------------
function git--branch() {
  execute_command "git branch -a"
}
#***********************************************************************


#***********************************************************************
# execute_command "git status"
#-----------------------------------------------------------------------
function git--status() {
  execute_command "git status"
}
#***********************************************************************


#***********************************************************************
# execute_command "git commit -a"
#-----------------------------------------------------------------------
function git--commit() {
  execute_command "git commit -a"
}
#***********************************************************************


#***********************************************************************
# execute_command "git push origin two_app "
#-----------------------------------------------------------------------
function git--push_two_app() {
  execute_command "git push origin two_app"
}
#***********************************************************************


#***********************************************************************
# output of hints about commands
#-----------------------------------------------------------------------
function cmd--help() {
	cat <<-EOF >&2
	  cmd:  br        -->  "git branch -a"
	  cmd:  st        -->  "git status"
	  cmd:  brst      -->  "git branch -a" and "git status"
	  cmd:  rembrst   -->  "git remote -v" and "git branch -a" and "git status"
	  cmd:  commit    -->  "git commit -a"
	  cmd:  push_two  -->  "git push origin two_app"
	EOF
}
#***********************************************************************






#***********************************************************************
#***********************************************************************
#     __main__
#-----------------------------------------------------------------------
#***********************************************************************
cmd_action="${1:-}"

case "$cmd_action" in
  push_two)
    git--push_two_app
    ;;
  commit)
		git--commit
		;;
  brst)
		git--branch
		git--status
		;;
  rembrst)
    git--remote
		git--branch
		git--status
		;;
  br)
#    clear
		git--branch
		;;
  st)
#    clear
		git--status
		;;
  lang)
    git--lang_en
    ;;
	*)
		cmd--help
		;;
esac
#***********************************************************************
#***********************************************************************
